programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte5/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "recipe_type", "cuisine", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "cook_method") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.create(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "cook_method" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["cook_method", "pegue o arroz e faça o ovo"], ["updated_at", "2021-04-24 17:16:01.180228"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(edit.id)
    @recipe.update(recipe_params)