programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte7/app/views/recipes/new.html.erb

SELECT "recipe_types".* FROM "recipe_types"
---
  <%= f.label :recipe_type_id, 'Tipo da Receita' %>
  <%= f.collection_select(:recipe_type_id, RecipeType.all, :id, :name) %>