programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte3/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @recipes = Recipe.find(params[:id])