programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte7/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save
---
INSERT INTO "recipes" ("title", "cuisine", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "cook_method", "recipe_type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = ?, "recipe_type_id" = ?, "cook_time" = ?, "ingredients" = ?, "cook_method" = ?, "updated_at" = ? WHERE "recipes"."id" = ?