programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte4/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "recipe_type", "cuisine", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "cook_method") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_fields)

    if @recipe.save