programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte10/app/controllers/cuisines_controller.rb

  def show
    @cuisine = Cuisine.find(params[:id])
---
SELECT "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @cuisine = Cuisine.new(cuisine_params)

    if @cuisine.save
---
INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Arabe"], ["created_at", "2021-04-28 17:39:31.548259"], ["updated_at", "2021-04-28 17:39:31.548259"]]