programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte6/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "recipe_type", "cuisine", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "cook_method") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)

    return redirect_to @recipe if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = ?, "recipe_type" = ?, "cuisine" = ?, "difficulty" = ?, "cook_time" = ?, "ingredients" = ?, "cook_method" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", ""], ["recipe_type", ""], ["cuisine", ""], ["difficulty", ""], ["cook_time", nil], ["ingredients", ""], ["cook_method", ""], ["updated_at", "2021-04-24 18:51:53.862619"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])

    return redirect_to @recipe if @recipe.update(recipe_params)