programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte8/app/controllers/recipe_types_controller.rb

SELECT "recipe_types".* FROM "recipe_types" WHERE "recipe_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @recipe_type = RecipeType.find(params[:id])

INSERT INTO "recipe_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sobremesa"], ["created_at", "2021-04-28 15:53:40.600272"], ["updated_at", "2021-04-28 15:53:40.600272"]]
---
    def create
        @recipe_type = RecipeType.new(recipe_type_params)
        if @recipe_type.save