programming_challenges/ruby_on_rails_e_testes_codesaga/cookbook_parte9/app/views/recipes/edit.html.erb

SELECT "cuisines".* FROM "cuisines"
---
  <%= f.label :cuisine_id, 'Cozinha' %>
  <%= f.collection_select(:cuisine_id, Cuisine.all, :id, :name) %>